#99  18 个位：1个 十几：11个 二十到七十：5 七十一到七十三：1
#473 198  最高位100，光算百位100个1。 400来看次高位之后出现4次满状态99，20*4. 还有73待会处理（18个）-》处理73：最高位10，下面是9，光算十位10个，次高位出现7次满状态7个，还有3待会处理-》1个
#9：1
#99：20
#999：300
#9999：4000
#99999: 50000
#999999: 600000
#9999999: 7000000
#99999999: 80000000
#999999999: 900000000
# 依次处理最高位，考虑最高位为1，不为1时的情况
class Solution:
    def countDigitOne(self, n: int) -> int:
        list9=[0,1,20,300,4000,50000,600000,7000000,80000000,900000000]
        n=str(n)
        total=0
        for i in range(len(n)):
            if(int(n[i])>1):
                total+=10**(len(n)-1-i)
            if(int(n[i])==1):
                total+=int('0'+n[i+1:])+1
            if(int(n[i])==0):
                continue
            total+=(int(n[i])*list9[len(n)-1-i])
        return total
a=Solution()
print(a.countDigitOne(1))
print(int('0'+'4'))
print(774+198)